App_T4/src/jbiasa/App_T4.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="App_T4"
             xmlns:tns="App_T4" xmlns:ns="http://j2ee.netbeans.org/wsdl/BPEL_T4/src/Entrada" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/BPEL_T4/src/Entrada" location="../jbiServiceUnits/BPEL_T4/Entrada.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:EntradaPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="EntradaOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="App_T4"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="App_T4"/>
            </output>
        </operation>
    </binding>
    <service name="App_T4Service1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/App_T4Service1/casaPort1"/>
        </port>
    </service>
</definitions>
