App_T4/test/Prueba3/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:app="App_T4">
  <soapenv:Body>
    <app:EntradaOperation>
      <nombre>Julian25</nombre>
    </app:EntradaOperation>
  </soapenv:Body>
</soapenv:Envelope>